app/views/friendships/_form.html.erb

  <div class="form-inputs">
    <%= f.association :expert, :collection => Expert.all, :label_method => :fullname, :value_method => :id %>
---
SELECT "experts".* FROM "experts"