app/controllers/experts_controller.rb

SELECT "experts".* FROM "experts" WHERE (firstname LIKE '%{"search"=>"tom"}%')
---
  def index
    @experts = Expert.all

SELECT "experts".* FROM "experts" WHERE "experts"."id" = $1 ORDER BY "experts"."id" ASC LIMIT 1  [["id", 3]]
---
  def set_current_expert
    $current_expert = Expert.find(params[:id])

INSERT INTO "experts" ("created_at", "firstname", "surname", "updated_at", "website") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["created_at", Thu, 09 Jan 2014 20:32:30 UTC +00:00], ["firstname", "adsfadsf"], ["surname", "safascf"], ["updated_at", Thu, 09 Jan 2014 20:32:30 UTC +00:00], ["website", "sadsa"]]
---
  def create
    @expert = Expert.new(expert_params)

    respond_to do |format|
      if @expert.web_check && @expert.save

UPDATE "experts" SET "website" = $1, "long_website" = $2, "updated_at" = $3 WHERE "experts"."id" = 34  [["website", "http://scotchcare.co.uk"], ["long_website", "scotchcare.co.uk"], ["updated_at", Thu, 16 Jan 2014 02:33:02 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @expert.update(expert_params)

DELETE FROM "experts" WHERE "experts"."id" = $1  [["id", 1]]
---
  def destroy
    if ($current_expert == @expert)
      $current_expert = nil
    end
    @expert.destroy