app/controllers/experts_controller.rb

SELECT "tags".* FROM "tags" WHERE "tags"."expert_id" = $1  [["expert_id", 4]]
---
  def show
    @tags = @expert.tags.paginate(:page => params[:tag_page], :per_page => 5)