app/controllers/friendships_controller.rb

  def index
    @friendships = Friendship.all
---
SELECT "friendships".* FROM "friendships"

  def create
    @friendship = Friendship.new(friendship_params)
    #if ($current_expert && friendship_params.value?($current_expert.id))
      #@newf = $current_expert.friendships.build(:friend_id => @friendship.friend_id)
      #@newinvf = $current_expert.inverse_friendships.build(:expert_id => @friendship.friend_id)
    #else

      @cur_ex = Expert.find(@friendship.expert_id)
      @newf = @cur_ex.friendships.build(:friend_id => @friendship.friend_id)
      @newinvf = @cur_ex.inverse_friendships.build(:expert_id => @friendship.friend_id)
    #end




    respond_to do |format|
      if @newf.save && @newinvf.save
---
SELECT "experts".* FROM "experts" WHERE "experts"."id" = $1 ORDER BY "experts"."id" ASC LIMIT 1  [["id", 7]]
INSERT INTO "friendships" ("created_at", "expert_id", "friend_id", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", Fri, 10 Jan 2014 23:22:27 UTC +00:00], ["expert_id", 1], ["friend_id", 2], ["updated_at", Fri, 10 Jan 2014 23:22:27 UTC +00:00]]

  def destroy

      @cur_ex = Expert.find(@friendship.expert_id)
       @newf = @cur_ex.inverse_friendships.where(expert_id: @friendship.friend_id, friend_id: @friendship.expert_id).first


    @friendship.destroy
---
SELECT "experts".* FROM "experts" WHERE "experts"."id" = $1 ORDER BY "experts"."id" ASC LIMIT 1  [["id", 2]]
SELECT "friendships".* FROM "friendships" WHERE "friendships"."friend_id" = $1 AND "friendships"."expert_id" = 5 AND "friendships"."friend_id" = 4 ORDER BY "friendships"."id" ASC LIMIT 1  [["friend_id", 4]]
DELETE FROM "friendships" WHERE "friendships"."id" = $1  [["id", 1]]

    def set_friendship
      @friendship = Friendship.find(params[:id])
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."id" = $1 LIMIT 1  [["id", "5"]]