app/controllers/tags_controller.rb

SELECT "tags".* FROM "tags"
---
  def index
    #Simpleforms doesnt like playing with searching...
    @tags = Tag.search(params[:search].first[1])