app/views/experts/index.html.erb

		        <td><%= expert.website %></td>
		        <td><%= expert.friendships.size %></td>
---
SELECT "friendships".* FROM "friendships" WHERE "friendships"."expert_id" = $1 AND "friendships"."friend_id" = 3 ORDER BY "friendships"."id" ASC LIMIT 1  [["expert_id", 4]]
SELECT COUNT(*) FROM "friendships" WHERE "friendships"."expert_id" = $1  [["expert_id", 1]]