app/views/experts/show.html.erb

SELECT "friendships".* FROM "friendships" WHERE "friendships"."expert_id" = $1 AND "friendships"."friend_id" = 3 ORDER BY "friendships"."id" ASC LIMIT 1  [["expert_id", 2]]
---
<h1>
  <%= @expert.fullname %><span class="badge"><%= @expert.friendships.length%></span>

SELECT "experts".* FROM "experts" WHERE "experts"."id" = $1 LIMIT 1  [["id", "1"]]
---
		    <% @expert.friendships.each do |friendship| %>
		    <% @friend = Expert.find(friendship.friend_id)%>

SELECT "tags".* FROM "tags" WHERE "tags"."expert_id" = $1  [["expert_id", 4]]
---
		  <tbody>
		    <% @expert.tags.each do |tag| %>